app/controllers/beverages_controller.rb

SELECT "beverages".* FROM "beverages"
---
  def index
    @beverages = Beverage.all

INSERT INTO "beverages" ("created_at", "image", "memo", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @beverage = Beverage.new(beverage_params)

    respond_to do |format|
      if @beverage.save

UPDATE "beverages" SET "image" = ?, "updated_at" = ? WHERE "beverages"."id" = 1  [["image", "maidong.jpeg"], ["updated_at", Wed, 09 Jul 2014 08:17:15 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @beverage.update(beverage_params)

SELECT "beverages".* FROM "beverages" WHERE "beverages"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_beverage
      @beverage = Beverage.find(params[:id])